; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v5 - type_1 ?v8 - type_3)
 	      (pred_4 ?v3 - object ?v8 - type_3)
	      (pred_1 ?v5 - type_1 ?v7 - type_2)
	      (pred_2 ?v5 - type_1 ?v3 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v5 - type_1 ?v2 ?v4 - type_3)
       :precondition (and  (pred_3 ?v5 ?v2))
       :effect (and  (pred_3 ?v5 ?v4)
		     (not (pred_3 ?v5 ?v2))))

   (:action op_2
       :parameters (?v5 - type_1 ?v1 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v6) (pred_3 ?v5 ?v6) (pred_1 ?v5 ?v7))
       :effect (and (pred_2 ?v5 ?v1 ?v7)
		    (not (pred_4 ?v1 ?v6)) 
		    (not (pred_1 ?v5 ?v7))))

   (:action op_3
       :parameters (?v5 - type_1 ?v1 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v1 ?v7) (pred_3 ?v5 ?v6))
       :effect (and (pred_4 ?v1 ?v6)
		    (pred_1 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v1 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_02 - type_1
obj_09 obj_03 obj_04 obj_12 - type_2
obj_10 obj_07 obj_01 - type_3
obj_11 obj_08 obj_05 - object)
(:init
(pred_3 obj_06 obj_10)
(pred_1 obj_06 obj_09)
(pred_1 obj_06 obj_03)
(pred_3 obj_02 obj_07)
(pred_1 obj_02 obj_04)
(pred_1 obj_02 obj_12)
(pred_4 obj_11 obj_01)
(pred_4 obj_08 obj_07)
(pred_4 obj_05 obj_07)
)
(:goal
(and
(pred_4 obj_11 obj_07)
(pred_4 obj_08 obj_10)
(pred_4 obj_05 obj_07)
)
)

(:constraints
  (always (not (pred_3 obj_06 obj_01)))
)
)

; plan
1. (op_1 obj_06 obj_10 obj_07)
   deleted: (pred_3 obj_06 obj_10)
   added: (pred_3 obj_06 obj_07)
   goals met: 1 of 3
2. (op_2 obj_02 obj_08 obj_07 obj_12)
   deleted: (pred_4 obj_08 obj_07) (pred_1 obj_02 obj_12)
   added: (pred_2 obj_02 obj_08 obj_12)
   goals met: 1 of 3
3. (op_1 obj_02 obj_07 obj_10)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_10)
   goals met: 1 of 3
4. (op_3 obj_02 obj_08 obj_10 obj_12)
   deleted: (pred_2 obj_02 obj_08 obj_12)
   added: (pred_4 obj_08 obj_10) (pred_1 obj_02 obj_12)
   goals met: 2 of 3
5. (op_1 obj_02 obj_10 obj_01)
   deleted: (pred_3 obj_02 obj_10)
   added: (pred_3 obj_02 obj_01)
   goals met: 2 of 3
6. (op_2 obj_02 obj_11 obj_01 obj_12)
   deleted: (pred_4 obj_11 obj_01) (pred_1 obj_02 obj_12)
   added: (pred_2 obj_02 obj_11 obj_12)
   goals met: 2 of 3
7. (op_1 obj_02 obj_01 obj_07)
   deleted: (pred_3 obj_02 obj_01)
   added: (pred_3 obj_02 obj_07)
   goals met: 2 of 3
8. (op_3 obj_02 obj_11 obj_07 obj_12)
   deleted: (pred_2 obj_02 obj_11 obj_12)
   added: (pred_4 obj_11 obj_07) (pred_1 obj_02 obj_12)
   goals met: 3 of 3
